# Challenge

### Import Pandas

In [10]:
import pandas as pd

### U.S. Major League Soccer Salaries

In [11]:
salaries = pd.read_csv("mls_salaries.csv")

### Remove NaN values

In [12]:
# return the DataFrame
salaries.tail(10)

    club last_name first_name position  base_salary  guaranteed_compensation
605  VAN   Rosales      Mauro        M      65004.0                 65004.00
606  VAN    Seiler       Cole        D      54075.0                 54075.00
607  VAN      Shea       Brek      M-D     625000.0                670000.00
608  VAN    Tchani       Tony        M     275000.0                308333.33
609  VAN   Techera   Cristian        M     352000.0                377000.00
610  VAN   Teibert    Russell        M     126500.0                194000.00
611  VAN  Tornaghi      Paolo       GK      80000.0                 80000.00
612  VAN    Waston    Kendall        D     350000.0                368125.00
613  NaN       NaN        NaN      NaN          NaN                      NaN
614  VAN  Williams    Sheanon        D     175000.0                184000.00

### Return information about the DataFrame including Non_Null Count

In [13]:
# return info about salaries
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 615 entries, 0 to 614
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     614 non-null    object
 1   last_name                614 non-null    object
 2   first_name               610 non-null    object
 3   position                 604 non-null    object
 4   base_salary              614 non-null    float64
 5   guaranteed_compensation  614 non-null    float64
dtypes: float64(2), object(4)
memory usage: 29.0+ KB

### Drop any rows with missing values

In [14]:
# drop any row that contains a NaN value
salaries.dropna(inplace=True)

### Return information about the DataFrame including Non_Null Count

In [15]:
# return info about salaries
salaries.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 600 entries, 0 to 614
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     600 non-null    object
 1   last_name                600 non-null    object
 2   first_name               600 non-null    object
 3   position                 600 non-null    object
 4   base_salary              600 non-null    float64
 5   guaranteed_compensation  600 non-null    float64
dtypes: float64(2), object(4)
memory usage: 32.8+ KB